Revit 2027 API
StructuralConnectionHandler.AddReferences Method
 Adds references to the connection. All references should be of applicable category.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void AddReferences(
	Document document,
	IList<Reference> picks
)
Public Sub AddReferences (
	document As Document,
	picks As IList(Of Reference)
)
public:
void AddReferences(
	Document^ document,
	IList<Reference^>^ picks
)
member AddReferences :
        document : Document *
        picks : IList<Reference> -> unit
Parameters
document Document
 The document.
picks IList<Reference>
 The array containing picks of input elements to be added.
Exceptions
Exception | Condition
ArgumentException |  One or more picks was not permitted to be add to the connection. -or- One or more picks was not permitted to be added to the connection. Picks should not be duplicated.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
StructuralConnectionHandler Class
Autodesk.Revit.DB.Structure Namespace